cf_billing/InformationRegisters/энргКатегорииНадежностиТочекПоставок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКатегорииНадежностиТочекПоставок</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВТомЧисле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТочкаПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияНадежности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргКатегорииНадежности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргКатегорииНадежностиТочекПоставок/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает категории напряжения.
//
// Параметры:
//  Период	-	Дата.
//  мТочек	-	Массив из СправочникСсылка.энргТочкиУчета.
// 
// Возвращаемое значение:
//   Соответствие.
//
Функция ПолучитьКатегорииНапряжения(Период, мТочек) Экспорт
	СоответствиеКатегорий = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргКатегорииНадежностиТочекПоставокСрезПоследних.ТочкаПоставки КАК ТочкаПоставки,
		|	энргКатегорииНадежностиТочекПоставокСрезПоследних.КатегорияНадежности КАК КатегорияНадежности,
		|	энргКатегорииНадежностиТочекПоставокСрезПоследних.ВТомЧисле КАК ВТомЧисле
		|ИЗ
		|	РегистрСведений.энргКатегорииНадежностиТочекПоставок.СрезПоследних(&Период, ТочкаПоставки В (&мТочек)) КАК энргКатегорииНадежностиТочекПоставокСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	КатегорияНадежности
		|ИТОГИ ПО
		|	ТочкаПоставки";
	
	Запрос.УстановитьПараметр("мТочек", мТочек);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТочкаПоставки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаТочкаПоставки.Следующий() Цикл
		
		КатегорииНапряжения = "";
		
		ВыборкаДетальныеЗаписи = ВыборкаТочкаПоставки.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			КатегорииНапряжения = КатегорииНапряжения + ?(КатегорииНапряжения <> "", ",", "") + ?(ВыборкаДетальныеЗаписи.ВТомЧисле, "(" + ВыборкаДетальныеЗаписи.КатегорияНадежности + ")", ВыборкаДетальныеЗаписи.КатегорияНадежности); 
		КонецЦикла;
		
		СоответствиеКатегорий.Вставить(ВыборкаТочкаПоставки.ТочкаПоставки, КатегорииНапряжения);

	КонецЦикла;

	Возврат СоответствиеКатегорий;
КонецФункции

#КонецОбласти

#КонецЕсли
